{
    "¿Cuál es tu nombre?": "Soy una IA llamada GenOsAi y estoy creada para ayudarte.",
    "¿Qué puedes hacer?": "Puedo realizar operaciones matemáticas simples, responder preguntas y aprender de ti.",
    "¿Cómo estás?": "¡Estoy aquí para ayudarte! ¿Y tú?",
    "¿Qué es la inteligencia artificial?": "La inteligencia artificial es la simulación de procesos de inteligencia humana por parte de sistemas informáticos.",
    "¿Cuál es la capital de Francia?": "La capital de Francia es París.",
    "¿Cuántos continentes hay en el mundo?": "Hay siete continentes en el mundo.",
    "¿Qué es el aprendizaje automático?": "El aprendizaje automático es una rama de la inteligencia artificial que permite a las máquinas aprender de los datos.",
    "¿Quién escribió 'Cien años de soledad'?": "El autor de 'Cien años de soledad' es Gabriel García Márquez.",
    "¿Qué es un agujero negro?": "Un agujero negro es una región del espacio donde la gravedad es tan fuerte que nada puede escapar de ella.",
    "¿Cuál es la fórmula del agua?": "La fórmula química del agua es H2O.",
    "¿Qué es la fotosíntesis?": "La fotosíntesis es el proceso mediante el cual las plantas convierten la luz solar en energía química.",
    "¿Quién fue Albert Einstein?": "Albert Einstein fue un físico teórico conocido por desarrollar la teoría de la relatividad.",
    "¿Qué es la teoría de la relatividad?": "La teoría de la relatividad es una teoría física que describe la gravedad como una curvatura del espacio-tiempo.",
    "¿Cuándo se descubrió América?": "América fue descubierta en 1492 por Cristóbal Colón.",
    "¿Qué es la gravedad?": "La gravedad es una fuerza que atrae a los objetos entre sí, especialmente a los cuerpos masivos como planetas y estrellas.",
    "¿Cuáles son los planetas del sistema solar?": "Los planetas del sistema solar son Mercurio, Venus, Tierra, Marte, Júpiter, Saturno, Urano y Neptuno.",
    "¿Qué es un ecosistema?": "Un ecosistema es una comunidad de organismos que interactúan entre sí y con su entorno físico.",
    "¿Qué es la evolución?": "La evolución es el proceso mediante el cual las especies cambian a lo largo del tiempo a través de la selección natural.",
    "¿Quién fue Leonardo da Vinci?": "Leonardo da Vinci fue un polímata del Renacimiento, conocido por sus obras de arte y sus contribuciones a la ciencia y la ingeniería.",
    "¿Qué es la energía renovable?": "La energía renovable es la energía que se obtiene de fuentes naturales que se regeneran a un ritmo mayor al de su consumo.",
    "¿Qué es la teoría de cuerdas?": "La teoría de cuerdas es una teoría en física que propone que las partículas fundamentales son en realidad 'cuerdas' vibrantes.",
    "¿Qué es la cultura?": "La cultura es el conjunto de costumbres, creencias, arte y conocimientos que caracterizan a un grupo social.",
    "¿Quién fue Mahatma Gandhi?": "Mahatma Gandhi fue un líder político y espiritual de la India, conocido por su filosofía de la no violencia.",
    "¿Qué es el cambio climático?": "El cambio climático se refiere a los cambios a largo plazo en las temperaturas y patrones climáticos de la Tierra.",
    "¿Qué es la inteligencia emocional?": "La inteligencia emocional es la capacidad de reconocer, entender y gestionar nuestras propias emociones y las de los demás.",
    "¿Qué es un algoritmo?": "Un algoritmo es un conjunto de instrucciones o reglas definidas para resolver un problema o realizar una tarea.",
    "¿Qué es la biología?": "La biología es la ciencia que estudia a los seres vivos y su interacción con el medio ambiente.",
    "¿Qué es la física cuántica?": "La física cuántica es la rama de la física que estudia los fenómenos a nivel subatómico.",
    "¿Quién fue Isaac Newton?": "Isaac Newton fue un físico y matemático inglés, conocido por sus leyes del movimiento y la ley de la gravitación universal.",
    "¿Qué es la democracia?": "La democracia es un sistema de gobierno en el que el poder es ejercido por el pueblo, generalmente a través de elecciones.",
    "¿Qué es la literatura?": "La literatura es el arte de la expresión escrita, que incluye géneros como la poesía, la narrativa y el teatro.",
    "¿Qué es la música?": "La música es el arte de organizar sonidos y silencios en el tiempo, creando una forma de expresión emocional.",
    "¿Quién fue Platón?": "Platón fue un filósofo griego, alumno de Sócrates y maestro de Aristóteles, conocido por sus diálogos y su teoría de las Ideas.",
    "¿Qué es la ética?": "La ética es la rama de la filosofía que estudia la moral y los principios que rigen el comportamiento humano.",
    "¿Qué es la geografía?": "La geografía es la ciencia que estudia la superficie terrestre, sus características físicas y la distribución de los seres humanos."
}